#5 Membalik urutan baris dan kolom pada Data Frame

Import Modules :

modul yang kita import ada 2 antara lain :
1. pandas
2. numpy

In [4]:
import pandas as pd
import numpy as np

-Setelah itu sebaiknya kita mengecek terlebih dahulu versi  pandas dan numpy yang kita gunakan saat ini, bertujuan agar apabila terjadi perbedaan output atau tampilan itu kemungkinan besar di sebabkan oleh perbedaan versi yang di gunakan.

In [5]:
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

Persiapan Data Frame

-membuat variabel n_rows yang menandakan jumlah baris

-membuat variabel n_cols yang menandakan jumlah kolom

-dan memanfaatkan tuple yang dikenakan terhadap String

-contoh : String 'LAMPU' yang dikenakan tuple akan menghasilkan tuple seperti ini 'L','A','M', 'P','U'.

-np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols) artinya data frame akan diisi dengan bilangan integer dengan range 1 sampai 10 (1,2,3,4,5,6,7,8,9) yang muncul secara random. Kemudian, untuk banyak data yang ditampilkan itu ditentukan oleh n_rows dan n_cols.

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('LAMPU')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)
df

   L  A  M  P  U
0  2  1  2  9  3
1  1  5  1  3  7
2  6  8  5  6  1
3  6  4  4  7  4
4  5  3  2  4  8

Membalik urutan kolom

-membalik urutan kolom disini artinya kolom yang tadinya dimulai dari L A M P U akan kita balikkan urutannya menjadi U P M A L dengan menggunakan loc yang di sertai tanda siku buka dan siku tutup [].

-dengan menuliskan df.loc[:, ::-1]

-di dalam kolom siku buka dan siku tutup terdapat 2 bagian yaitu bagian pertama blank: dan bagian kedua blank:blank:blank-1

-bagian pertama berfungsi mengatur baris

-bagian kedua berfungsi mengatur kolom

In [9]:
df.loc[:,::-1]

   U  P  M  A  L
0  3  9  2  1  2
1  7  3  1  5  1
2  1  6  5  8  6
3  4  7  4  4  6
4  8  4  2  3  5

Membalik urutan baris

-membalik urutan baris disini artinya baris yang tadinya dimulai dari 0 1 2 3 4 akan kita balikkan urutannya menjadi 4 3 2 1 0 dengan menggunakan loc yang di sertai tanda siku buka dan siku tutup [] juga

-Bedanya dengan membalik kolom adalah disini kita hanya cukup menuliskan df.loc[::-1]

In [10]:
df.loc[::-1]

   L  A  M  P  U
4  5  3  2  4  8
3  6  4  4  7  4
2  6  8  5  6  1
1  1  5  1  3  7
0  2  1  2  9  3

Membalik urutan baris dan melakukan penyesuaian ulang index

-kita ingin melakukan reset pada indexnya dengan memanggil fungtion reset_index dengan parameter drop dengan nilai true.

-urutan barisnya terbalik tetapi indeknya yang kita reset ke semula.

In [11]:
df.loc[::-1].reset_index(drop=True)

   L  A  M  P  U
0  5  3  2  4  8
1  6  4  4  7  4
2  6  8  5  6  1
3  1  5  1  3  7
4  2  1  2  9  3